'''
28.11.22
-If2. 
Дано целое число. Если оно является положительным, то прибавить к нему 1; в противном случае вычесть из него 2. Вывести полученное число. 
'''
a=int(input())
if a>0:
    a+=1 
else:
    a-=2
print(a)
    