'''
21.11.2022
ЛБ 7 (строки)
Егорова Виктория 21Ис
Задание 1
Задача «Количество слов». Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения задачи метод count.
'''
#print(len(input().split()))
print(str.count(input()," ")+1)
